<?php

defined('i18n_ar') or define('i18n_ar', [
	'private' => [
		'default' => [
			'text' => joinDoubleLine(
				"مرحبًا بك في <b>%bot_title%</b> 🙅‍♂️",
				"أنا بالتأكيد لست أفضل بوت يمكنك الحصول عليه مع قليل جدًا من الخبرة في البلوكشين.",
				"%prices%",
				"👛 إليك محافظك:",
				"%wallets%",
				"💡 للحصول على المزيد من المعلومات حول محفظتك وللحصول على مفتاحك الخاص، اضغط على زر المحفظة.",
				"🔑 يمكنك أيضًا استيراد محافظك الحالية وربما تراهن على ما إذا كنت ستتعرض للخداع أم لا، ربما؟ %bot_title%!",
				"🫰 لأغراض الاختبار، يمكنك إنشاء أوامر برصيد صفر في المحفظة.",
			),
			'buttons' => [
				'wallets'    => '💳 المحافظ',
				'refresh'    => '🔄 تحديث',
				'swap'       => '⚡️ التبديل الفوري',
				'conditions' => '🗒 قائمة الشروط',
				'alerts'     => '🔔 التنبيهات',
				'import'     => '🔑 استيراد المحفظة',
				'copy'       => '👁‍🗨 نسخ التجارة',
				'trade'      => '💸 شروط التجارة',
				'languages'  => 'اللغة',
				'rates'      => '📊 تتبع الأسعار',
			],
		],
		'custom_asset' => [
			'invalid_address' => 'من فضلك أرسل عنوانًا صالحًا للأصل <b>%type%</b>. يمكنك استخدام /start لإلغاء العملية.',
			'processing' => '⏳ من فضلك انتظر بينما نقوم بمعالجة الأصل...',
			'invalid_asset' => '❌ للأسف لا يمكننا معالجة هذا الأصل.',
			'inactive' => '🚫 هذا الأصل غير متوفر حاليًا في DEX.',
		],
	],
	'inline_query' => [
		'price' => "السعر الحالي لـ <b>%symbol%</b> هو <b>%price%</b>.",
		'notfound' => [
			'title' => 'لم يتم العثور عليه',
			'message' => "لا يمكننا العثور على أي نتائج تتطابق مع استفسارك."
		],
	],
	'callback_query' => [
		'fallback' => 'الصمت ذهب',
		'refresh' => '🔄 تم تحديث البيانات 🔄',
		'default' => '✔️',
		'wallets' => [
			'answer' => '💳 قائمة المحافظ 💳',
			'text'   => joinDoubleLine(
				"💡 لديك <b>%count%</b> محافظ نشطة (الحد الأقصى: %max%)",
				"%wallets%",
				"⚙️ يمكنك إدارة كل محفظة بالنقر على الأزرار أدناه."
			),
			'buttons' => [
				'new' => 'إنشاء محفظة جديدة',
				'copy' => 'نسخ العنوان',
			],
		],
		'conditions' => [
			'answer' => '🗒 شروط التجارة 🗒',
			'text'   => joinDoubleLine(
				"💡 لديك <b>%count%</b> شروط تجارة معلقة (الحد الأقصى: %max%)",
				"%conditions%",
				"⚙️ يمكنك إدارة كل شرط بالنقر على الأزرار أدناه"
			),
			'delete' => [
				'answer' => '❌ حذف الشرط ❌',
				'text' => joinDoubleLine(
					"<b>هل أنت متأكد من أنك تريد حذف هذا الشرط؟</b>",
					'%condition%',
					"إذا لم تكن مخمورًا، اضغط على زر ⏹️ لحذف الشرط.",
				),
			],
			'info' => [
				'answer' => '🗒 معلومات الشرط 🗒',
				'text' => joinDoubleLine(
					'🗒 إليك شرطك:',
					'%condition%',
					'⚙️ يمكنك إدارة الشرط بالنقر على الأزرار أدناه.',
				),
				'buttons' => [
					'delete' => '❌ حذف الشرط',
				],
			],
			'errors' => [
				'max' => '🚫 لقد وصلت بالفعل إلى الحد الأقصى لعدد الشروط النشطة <b>%max%</b>، يرجى حذف بعضها قبل المتابعة.',
			],
			'trigger' => "🗒 تم تفعيل <b>%type%</b> الخاص بك لـ <b>%amount% %symbol%</b> بسعر <b>%price%</b> وسوف يتم إشعارك بنتيجة الطلب.",
		],
		'create' => [
			'answer' => '🔗 إنشاء محفظة 🔗',
			'text' => '🔗 أي نوع من المحافظ ترغب في إنشائه؟',
		],
		'create_wallet' => [
			'answer' => '⛓️ تم إنشاء المحفظة ⛓️',
			'answer_max' => '🚫 لديك بالفعل %max%/%max% محافظ نشطة.',
			'text' => joinDoubleLine(
				'⛓️ إليك محفظتك الجديدة:',
				'%wallet%',
			),
		],
		'import_wallet' => [
			'answer' => 'قريبًا، أو ربما لا',
		],
		'wallet_info' => [
			'answer' => '💳 معلومات المحفظة 💳',
			'text' => joinDoubleLine(
				'💳 إليك محفظتك:',
				'%wallet%',
				'⚙️ يمكنك إدارة المحفظة بالنقر على الأزرار أدناه.',
			),
			'buttons' => [
				'export' => '📤 تصدير المحفظة',
				'delete' => '❌ حذف المحفظة',
			],
		],
		'wallet_del' => [
			'answer' => '❌ حذف المحفظة ❌',
			'answer_min' => '🚫 يجب أن يكون لديك على الأقل %min% محافظ نشطة.',
			'text' => joinDoubleLine(
				"<b>هل أنت متأكد تمامًا من أنك تريد حذف هذه المحفظة؟</b> لا يمكن استعادتها إذا لم تقم بتصديرها وحفظها بنفسك.",
				"يرجى ملاحظة أنه بحذف المحفظة، سيتم مسح جميع أوامر التجارة الخاصة بها.",
				'%wallet%',
				"إذا لم تكن مخمورًا، اضغط على زر ⏹️ لحذف المحفظة.",
			),
		],
		'wallet_export' => [
			'answer' => '📤 تصدير المحفظة 📤',
			'text' => joinDoubleLine(
				"🔐 يرجى حفظ المعلومات أدناه بأمان.",
				"%type_emoji% البلوكشين: %type%",
				joinLine("<b>⛓️ العنوان:</b>", "<code>%address%</code>"),
				joinLine("<b>🔓 المفتاح العام:</b>", "<code>%public%</code>"),
				joinLine("<b>🔐 المفتاح الخاص:</b>", "<code>%secret%</code>"),
				joinLine("<b>🔏 العبارة المميزة:</b>", "%mnemonic%"),
				"⚠️ لا تكن غبيًا بمشاركة سر محفظتك مع شخص يعدك بأن يجعلك غنيًا.",
			),
		],
		'languages' => [
			'answer' => 'اللغات',
			'text'   => 'يرجى اختيار اللغة التي ترغب بها:',
		],
		'trade' => [
			'answer' => '💸 شروط التجارة 💸',
			'text'   => joinDoubleLine(
				'💡 يمكنك أتمتة صفقاتك بناءً على الشروط.',
				"%wallets%",
				'💳 يرجى اختيار محفظة لتحديد شروط التجارة:',
			),
		],
		'custom_asset' => [
			'answer' => 'يرجى إرسال عنوان العقد للأصل على البلوكشين %type%. يمكنك استخدام /start لإلغاء.',
			'buttons' => [
				'custom' => 'عنوان مخصص',
			],
		],
		'trade_info' => [
			'answer' => '💸 شروط التجارة 💸',
			'text'   => joinDoubleLine(
				'💡 يمكنك أتمتة صفقاتك بناءً على الشروط.',
				"%wallet%",
			),
			'buttons' => [
				'limit' => '💢 أمر محدود',
				'tp'    => '💰 أخذ الأرباح',
				'sl'    => '🛑 وقف الخسارة',
			],
		],
		'trade_limit' => [
			'answer' => '💢 أمر محدود 💢',
			'text'   => joinDoubleLine(
				"🎯 يرجى اختيار الأصل الهدف الذي ترغب في شرائه باستخدام <b>%type%</b>. إذا كان الأصل الهدف غير مدرج أدناه، يمكنك اختيار عنوان مخصص.",
				"%wallet%",
			),
			'condition' => [
				'text' => joinDoubleLine(
					"<b>💢 أمر محدود</b>",
					joinLine(
						"🪙 %name% (<b>%symbol%</b>) (<b>%price%</b>)",
						"<code>%address%</code>"
					),
					"%wallet%",
					"💸 لديك <b>%balance% %symbol%</b>",
				),
				'price' => 'يرجى إدخال السعر الهدف لشراء <b>%symbol%</b> باستخدام <b>%type%</b> في <b>USD</b> (على سبيل المثال: <code>%price%</code>):',
				'amount' => 'يرجى إدخال كمية <b>%type%</b> التي ترغب في استبدالها بـ <b>%symbol%</b> عندما يصل <b>%symbol%</b> إلى <b>%price%</b>:',
				'success' => '✅ تم وضع أمر الحد الخاص بك لاستبدال <b>%amount% %type%</b> بـ <b>%symbol%</b> عندما يصل إلى <b>%price%</b> بنجاح. يمكنك متابعة /start للاستمرار.',
				'errors' => [
					'price_invalid' => 'السعر الذي أدخلته ليس سعرًا رقميًا صالحًا. يرجى إدخال سعر صالح. يمكنك استخدام /start لإلغاء.',
					'price_higher'  => 'السعر الذي أدخلته أعلى بالفعل من <b>%price%</b> الحالي، يمكنك استخدام التجارة الفورية. يرجى إدخال سعر صالح. يمكنك استخدام /start لإلغاء.',
					'amount_invalid' => 'الكمية التي أدخلتها ليست قيمة رقمية صالحة. يرجى إدخال كمية صالحة. يمكنك استخدام /start لإلغاء.',
				],
			],
		],
		'trade_tp' => [
			'answer' => '💰 أخذ الأرباح 💰',
			'text'   => joinDoubleLine(
				"🎯 يرجى اختيار الأصل الهدف الذي ترغب في بيعه واستلام <b>%type%</b>. إذا كان الأصل الهدف غير مدرج أدناه، يمكنك اختيار عنوان مخصص.",
				"%wallet%",
			),
			'condition' => [
				'text' => joinDoubleLine(
					"<b>💰 أخذ الأرباح</b>",
					joinLine(
						"🪙 %name% (<b>%symbol%</b>) (<b>%price%</b>)",
						"<code>%address%</code>"
					),
					"%wallet%",
					"💸 لديك <b>%balance% %symbol%</b>",
				),
				'price' => 'يرجى إدخال السعر الهدف لبيع <b>%symbol%</b> في <b>USD</b> واستلام <b>%type%</b> (على سبيل المثال: <code>%price%</code>):',
				'amount' => 'يرجى إدخال كمية <b>%symbol%</b> لبيعها عندما تصل إلى <b>%price%</b>:',
				'success' => '✅ تم وضع أمر أخذ الأرباح الخاص بك لبيع <b>%amount% %symbol%</b> عندما يصل <b>%symbol%</b> إلى <b>%price%</b> بنجاح. يمكنك متابعة /start للاستمرار.',
				'errors' => [
					'price_invalid'  => 'السعر الذي أدخلته ليس سعرًا رقميًا صالحًا. يرجى إدخال سعر صالح. يمكنك استخدام /start لإلغاء.',
					'price_lower'    => 'السعر الذي أدخلته أقل من <b>%price%</b> الحالي، يمكنك تحديد وقف الخسارة لهذا. يرجى إدخال سعر صالح. يمكنك استخدام /start لإلغاء.',
					'amount_invalid' => 'الكمية التي أدخلتها ليست قيمة رقمية صالحة. يرجى إدخال كمية صالحة. يمكنك استخدام /start لإلغاء.',
				],
			],
		],
		'trade_sl' => [
			'answer' => '🛑 وقف الخسارة 🛑',
			'text'   => joinDoubleLine(
				"🎯 يرجى اختيار الأصل الهدف الذي ترغب في بيعه واستلام <b>%type%</b>. إذا كان الأصل الهدف غير مدرج أدناه، يمكنك اختيار عنوان مخصص.",
				"%wallet%",
			),
			'condition' => [
				'text' => joinDoubleLine(
					"<b>🛑 وقف الخسارة</b>",
					joinLine(
						"🪙 %name% (<b>%symbol%</b>) (<b>%price%</b>)",
						"<code>%address%</code>"
					),
					"%wallet%",
					"💸 لديك <b>%balance% %symbol%</b>",
				),
				'price' => 'يرجى إدخال السعر الهدف لبيع <b>%symbol%</b> في <b>USD</b> واستلام <b>%type%</b> (على سبيل المثال: <code>%price%</code>):',
				'amount' => 'يرجى إدخال كمية <b>%symbol%</b> لبيعها عندما ينخفض إلى <b>%price%</b>:',
				'success' => '✅ تم وضع أمر وقف الخسارة الخاص بك لبيع <b>%amount% %symbol%</b> عندما ينخفض <b>%symbol%</b> إلى <b>%price%</b> بنجاح. يمكنك متابعة /start للاستمرار.',
				'errors' => [
					'price_invalid'  => 'السعر الذي أدخلته ليس سعرًا رقميًا صالحًا. يرجى إدخال سعر صالح. يمكنك استخدام /start لإلغاء.',
					'price_higher'   => 'السعر الذي أدخلته أعلى من <b>%price%</b> الحالي، يمكنك تحديد أخذ الأرباح لذلك. يرجى إدخال سعر صالح. يمكنك استخدام /start لإلغاء.',
					'amount_invalid' => 'الكمية التي أدخلتها ليست قيمة رقمية صالحة. يرجى إدخال كمية صالحة. يمكنك استخدام /start لإلغاء.',
				],
			],
		],
		'alerts' => [
			'answer' => '🔔 التنبيهات 🔔',
			'text'   => joinDoubleLine(
				"💡 لديك <b>%count%</b> تنبيهات نشطة (الحد الأقصى: %max%)",
				"%alerts%",
				"⚙️ يمكنك إدارة كل تنبيه بالنقر على الأزرار أدناه."
			),
			'buttons' => [
				'new' => 'إنشاء تنبيه جديد',
			],
			'create' => [
				'answer' => '🔗 اختيار البلوكشين 🔗',
				'text' => '🔗 أي بلوكشين ترغب في مراقبته؟',
			],
			'choose' => [
				'answer' => '🎯 اختيار الهدف 🎯',
				'text'   => "🎯 من فضلك اختر الأصل الهدف الذي ترغب في تتبعه. إذا كان الأصل الهدف غير مدرج أدناه، يمكنك اختيار عنوان مخصص.",
			],
			'type' => [
				'answer' => '📊 اختيار النوع 📊',
				'text' => '📊 أي نوع من حركة الأسعار لـ <b>%symbol%</b> ترغب في أن يتم إخطارك به — زيادة أم نقصان؟',
				'buttons' => [
					'increase' => '📈 زيادة',
					'decrease' => '📉 نقصان',
				],
			],
			'set' => [
				'answer' => '💲 إدخال السعر 💲',
				'price' => 'يرجى إدخال السعر المحدد لـ <b>%symbol%</b> في <b>USD</b> (مثال: <code>%price%</code>):',
				'success_0' => '📉 تم ضبط تنبيهك بشأن انخفاض سعر <b>%symbol%</b> إلى أقل من <b>%price%</b> بنجاح. يمكنك متابعة /start للاستمرار.',
				'success_1' => '📈 تم ضبط تنبيهك بشأن ارتفاع سعر <b>%symbol%</b> إلى أكثر من <b>%price%</b> بنجاح. يمكنك متابعة /start للاستمرار.',
				'errors' => [
					'price_invalid'  => 'السعر الذي أدخلته ليس سعرًا رقميًا صالحًا. يرجى إدخال سعر صالح. يمكنك استخدام /start لإلغاء.',
				],
			],
			'delete' => [
				'answer' => '❌ حذف التنبيه ❌',
				'text' => joinDoubleLine(
					"<b>هل أنت متأكد من أنك تريد حذف هذا التنبيه؟</b>",
					'%alert%',
					"إذا لم تكن مخمورًا، اضغط على زر ⏹️ لحذف التنبيه.",
				),
			],
			'info' => [
				'answer' => '🗒 معلومات التنبيه 🗒',
				'text' => joinDoubleLine(
					'🗒 إليك تنبيهك:',
					'%alert%',
					'⚙️ يمكنك إدارة التنبيه بالنقر على الأزرار أدناه.',
				),
				'buttons' => [
					'delete' => '❌ حذف التنبيه',
				],
			],
			'errors' => [
				'max' => '🚫 لقد وصلت بالفعل إلى الحد الأقصى لعدد التنبيهات النشطة <b>%max%</b>، يرجى حذف بعضها قبل المتابعة.',
			],
			'notify' => [
				'0' => '📉 سعر <b>%symbol%</b> انخفض إلى أقل من <b>%price%</b>.',
				'1' => '📈 سعر <b>%symbol%</b> ارتفع إلى أكثر من <b>%price%</b>.',
			],
		],
		'swap' => [
			'answer' => '⚡️ التبديل الفوري ⚡️',
			'create' => [
				'answer' => '🔗 اختيار المحفظة 🔗',
				'text' => joinDoubleLine(
					"<b>⚡️ التبديل الفوري ⚡️</b>",
					"%wallets%",
					'💳 من فضلك اختر محفظة للمتابعة',
				),
			],
			'choose' => [
				'answer' => '🎯 اختيار الهدف 🎯',
				'text'   => "🎯 من فضلك اختر الأصل الهدف الذي ترغب في تبديله. إذا كان الأصل الهدف غير مدرج أدناه، يمكنك اختيار عنوان مخصص.",
			],
			'type' => [
				'answer' => '↔️ اختيار النوع ↔️',
				'text' => '↔️ أي نوع من التبديلات لـ <b>%symbol% (%price%)</b> ترغب في إتمامه؟',
				'buttons' => [
					'buy' => '📥 شراء',
					'sell' => '📤 بيع',
				],
			],
			'set' => [
				'answer' => '💲 إدخال المبلغ 💲',
				'amount_0' => 'من فضلك أدخل كمية <b>%type%</b> للتبديل إلى <b>%symbol% (%price%)</b>:',
				'amount_1' => 'من فضلك أدخل كمية <b>%symbol% (%price%)</b> التي ترغب في بيعها:',
				'success_0' => '📥 تم وضع أمر الشراء الخاص بك لاستبدال <b>%amount% %type%</b> إلى <b>%symbol% (%price%)</b> بنجاح. ستتلقى إشعارًا بنتيجة التبديل. يمكنك متابعة /start للاستمرار.',
				'success_1' => '📤 تم وضع أمر البيع الخاص بك لـ <b>%amount% %symbol% (%price%)</b> بنجاح. ستتلقى إشعارًا بنتيجة التبديل. يمكنك متابعة /start للاستمرار.',
				'errors' => [
					'amount_invalid'  => 'المقدار الذي أدخلته ليس قيمة رقمية صالحة. يرجى إدخال مقدار صالح. يمكنك استخدام /start لإلغاء.',
				],
			],
			'transaction' => [
				'success' => '✅ تم إتمام عملية التبديل من <b>%from%</b> إلى <b>%to%</b> بنجاح.',
				'failed' => '❌ فشلت عملية التبديل من <b>%from%</b> إلى <b>%to%</b>.',
			],
		],
		'general' => [
			'buttons' => [
				'price' => 'إدخال السعر',
			],
			'expired' => '⚠️ هذه الرسالة قد انتهت صلاحيتها، يرجى استخدام الرسالة الأحدث للتفاعل.',
		],
	],
	'general' => [
		'balance' => 'الرصيد',
		'address' => 'العنوان',
		'back'    => '🔙 العودة',
		'copy'    => 'نسخ',
	],
]);
