<?php

defined('i18n_fa') or define('i18n_fa', [
	'private' => [
		'default' => [
			'text' => joinDoubleLine(
				"به <b>%bot_title%</b> خوش آمدید 🙅‍♂️",
				"من قطعاً بهترین رباتی نیستم که می‌توانید با تقریبا هیچ تجربه‌ای در زمینه بلاکچین دریافت کنید.",
				"%prices%",
				"👛 در اینجا کیف پول‌های شما هستند:",
				"%wallets%",
				"💡 برای کسب اطلاعات بیشتر در مورد کیف پول شما و دریافت کلید خصوصی، دکمه کیف پول را لمس کنید.",
				"🔑 همچنین می‌توانید کیف پول‌های موجود خود را وارد کنید و شاید روی اینکه کلاهبرداری خواهید شد یا خیر شرط بندی کنید، شاید؟ %bot_title%!",
				"🫰 برای اهداف آزمایشی، می‌توانید سفارش‌هایی با موجودی صفر در کیف پول ایجاد کنید.",
			),
			'buttons' => [
				'wallets'    => '💳 کیف پول‌ها',
				'refresh'    => '🔄 به‌روزرسانی',
				'swap'       => '⚡️ تعویض فوری',
				'conditions' => '🗒 فهرست شرایط',
				'alerts'     => '🔔 هشدارها',
				'import'     => '🔑 وارد کردن کیف پول',
				'copy'       => '👁‍🗨 کپی معامله',
				'trade'      => '💸 شرایط معامله',
				'languages'  => 'زبان',
				'rates'      => '📊 پیگیری نرخ‌ها',
			],
		],
		'custom_asset' => [
			'invalid_address' => 'لطفاً یک آدرس معتبر از دارایی <b>%type%</b> ارسال کنید. برای لغو، می‌توانید از /start استفاده کنید.',
			'processing' => '⏳ لطفاً منتظر بمانید تا دارایی پردازش شود...',
			'invalid_asset' => '❌ متاسفانه قادر به پردازش این دارایی نیستیم.',
			'inactive' => '🚫 این دارایی در حال حاضر در DEX در دسترس نیست.',
		],
	],
	'inline_query' => [
		'price' => "قیمت فعلی <b>%symbol%</b> برابر است با <b>%price%</b>.",
		'notfound' => [
			'title' => 'یافت نشد',
			'message' => "ما نمی‌توانیم هیچ نتیجه‌ای که با جستجوی شما تطابق داشته باشد پیدا کنیم."
		],
	],
	'callback_query' => [
		'fallback' => 'سکوت طلاست',
		'refresh' => '🔄 داده‌ها به‌روزرسانی شده‌اند 🔄',
		'default' => '✔️',
		'wallets' => [
			'answer' => '💳 فهرست کیف پول‌ها 💳',
			'text'   => joinDoubleLine(
				"💡 شما <b>%count%</b> کیف پول فعال دارید (حداکثر: %max%)",
				"%wallets%",
				"⚙️ شما می‌توانید هر کیف پول را با کلیک بر روی دکمه‌های زیر مدیریت کنید."
			),
			'buttons' => [
				'new' => 'ایجاد کیف پول جدید',
				'copy' => 'کپی آدرس',
			],
		],
		'conditions' => [
			'answer' => '🗒 شرایط معامله 🗒',
			'text'   => joinDoubleLine(
				"💡 شما <b>%count%</b> شرایط معامله معلق دارید (حداکثر: %max%)",
				"%conditions%",
				"⚙️ شما می‌توانید هر شرایط را با کلیک بر روی دکمه‌های زیر مدیریت کنید"
			),
			'delete' => [
				'answer' => '❌ حذف شرایط ❌',
				'text' => joinDoubleLine(
					"<b>آیا از حذف این شرایط مطمئن هستید؟</b>",
					'%condition%',
					"اگر مست نیستید، روی دکمه ⏹️ کلیک کنید تا شرایط حذف شود.",
				),
			],
			'info' => [
				'answer' => '🗒 اطلاعات شرایط 🗒',
				'text' => joinDoubleLine(
					'🗒 اینجا شرایط شما است:',
					'%condition%',
					'⚙️ شما می‌توانید شرایط را با کلیک بر روی دکمه‌های زیر مدیریت کنید.',
				),
				'buttons' => [
					'delete' => '❌ حذف شرایط',
				],
			],
			'errors' => [
				'max' => '🚫 شما به محدودیت <b>%max%</b> تعداد شرایط معامله فعال رسیده‌اید، لطفاً قبل از ادامه، برخی از آن‌ها را حذف کنید.',
			],
			'trigger' => "🗒 شرایط شما برای <b>%type%</b> به مبلغ <b>%amount% %symbol%</b> در <b>%price%</b> فعال شد و شما نتیجه سفارش را دریافت خواهید کرد.",
		],
		'create' => [
			'answer' => '🔗 ایجاد کیف پول 🔗',
			'text' => '🔗 چه نوع کیف پولی می‌خواهید ایجاد کنید؟',
		],
		'create_wallet' => [
			'answer' => '⛓️ کیف پول ایجاد شد ⛓️',
			'answer_max' => '🚫 شما قبلاً %max%/%max% کیف پول فعال دارید.',
			'text' => joinDoubleLine(
				'⛓️ اینجا کیف پول جدید شما است:',
				'%wallet%',
			),
		],
		'import_wallet' => [
			'answer' => 'به زودی، یا احتمالاً نه',
		],
		'wallet_info' => [
			'answer' => '💳 اطلاعات کیف پول 💳',
			'text' => joinDoubleLine(
				'💳 اینجا کیف پول شما است:',
				'%wallet%',
				'⚙️ شما می‌توانید کیف پول را با کلیک بر روی دکمه‌های زیر مدیریت کنید.',
			),
			'buttons' => [
				'export' => '📤 صادرات کیف پول',
				'delete' => '❌ حذف کیف پول',
			],
		],
		'wallet_del' => [
			'answer' => '❌ حذف کیف پول ❌',
			'answer_min' => '🚫 شما باید حداقل %min% کیف پول فعال داشته باشید.',
			'text' => joinDoubleLine(
				"<b>آیا از حذف این کیف پول کاملاً مطمئن هستید؟</b> هیچ راهی برای بازیابی آن وجود ندارد اگر آن را صادر نکرده‌اید و خودتان ذخیره نکردید.",
				"همچنین توجه داشته باشید که با حذف کیف پول، تمام سفارش‌های معاملاتی مربوط به آن کیف پول پاک می‌شود.",
				'%wallet%',
				"اگر مست نیستید، روی دکمه ⏹️ کلیک کنید تا کیف پول حذف شود.",
			),
		],
		'wallet_export' => [
			'answer' => '📤 صادرات کیف پول 📤',
			'text' => joinDoubleLine(
				"🔐 لطفاً اطلاعات زیر را ایمن نگه دارید.",
				"%type_emoji% بلاکچین: %type%",
				joinLine("<b>⛓️ آدرس:</b>", "<code>%address%</code>"),
				joinLine("<b>🔓 کلید عمومی:</b>", "<code>%public%</code>"),
				joinLine("<b>🔐 کلید خصوصی:</b>", "<code>%secret%</code>"),
				joinLine("<b>🔏 عبارت بازیابی:</b>", "%mnemonic%"),
				"⚠️ احمق نباشید و اطلاعات کیف پول خود را به کسی که قول می‌دهد شما را ثروتمند کند، ندهید.",
			),
		],
		'languages' => [
			'answer' => 'زبان‌ها',
			'text'   => 'لطفاً زبان مورد نظر خود را انتخاب کنید:',
		],
		'trade' => [
			'answer' => '💸 شرایط معامله 💸',
			'text'   => joinDoubleLine(
				'💡 شما می‌توانید معاملات خود را بر اساس شرایط خود خودکار کنید.',
				"%wallets%",
				'💳 لطفاً یک کیف پول برای تنظیم شرایط معامله انتخاب کنید:',
			),
		],
		'custom_asset' => [
			'answer' => 'لطفاً آدرس قرارداد دارایی را در بلاکچین %type% ارسال کنید. برای لغو، می‌توانید از /start استفاده کنید.',
			'buttons' => [
				'custom' => 'آدرس سفارشی',
			],
		],
		'trade_info' => [
			'answer' => '💸 شرایط معامله 💸',
			'text'   => joinDoubleLine(
				'💡 شما می‌توانید معاملات خود را بر اساس شرایط خود خودکار کنید.',
				"%wallet%",
			),
			'buttons' => [
				'limit' => '💢 سفارش محدود',
				'tp'    => '💰 برداشت سود',
				'sl'    => '🛑 توقف ضرر',
			],
		],
		'trade_limit' => [
			'answer' => '💢 سفارش محدود 💢',
			'text'   => joinDoubleLine(
				"🎯 لطفاً دارایی هدفی را که می‌خواهید با <b>%type%</b> خریداری کنید انتخاب کنید. اگر دارایی هدف شما در زیر فهرست نشده است، می‌توانید آدرس سفارشی را انتخاب کنید.",
				"%wallet%",
			),
			'condition' => [
				'text' => joinDoubleLine(
					"<b>💢 سفارش محدود</b>",
					joinLine(
						"🪙 %name% (<b>%symbol%</b>) (<b>%price%</b>)",
						"<code>%address%</code>"
					),
					"%wallet%",
					"💸 شما <b>%balance% %symbol%</b> دارید.",
				),
				'price' => 'لطفاً هدف قیمت برای خرید <b>%symbol%</b> با <b>%type%</b> در <b>USD</b> (مثلاً: <code>%price%</code>) وارد کنید:',
				'amount' => 'لطفاً میزان <b>%type%</b> را وارد کنید تا برای <b>%symbol%</b> زمانی که <b>%symbol%</b> به <b>%price%</b> برسد تعویض شود:',
				'success' => '✅ سفارش محدود شما برای تعویض <b>%amount% %type%</b> به <b>%symbol%</b> زمانی که به <b>%price%</b> برسد با موفقیت قرار داده شد. برای ادامه از /start استفاده کنید.',
				'errors' => [
					'price_invalid' => 'قیمتی که وارد کرده‌اید یک قیمت عددی معتبر نیست. لطفاً قیمت معتبر وارد کنید. برای لغو می‌توانید از /start استفاده کنید.',
					'price_higher'  => 'قیمتی که وارد کرده‌اید بالاتر از <b>%price%</b> فعلی است، می‌توانید از معامله فوری استفاده کنید. لطفاً قیمت معتبر وارد کنید. برای لغو می‌توانید از /start استفاده کنید.',
					'amount_invalid' => 'میزانی که وارد کرده‌اید یک مقدار عددی معتبر نیست. لطفاً میزان معتبر وارد کنید. برای لغو می‌توانید از /start استفاده کنید.',
				],
			],
		],
		'trade_tp' => [
			'answer' => '💰 برداشت سود 💰',
			'text'   => joinDoubleLine(
				"🎯 لطفاً دارایی هدفی را که می‌خواهید بفروشید و <b>%type%</b> دریافت کنید انتخاب کنید. اگر دارایی هدف شما در زیر فهرست نشده است، می‌توانید آدرس سفارشی را انتخاب کنید.",
				"%wallet%",
			),
			'condition' => [
				'text' => joinDoubleLine(
					"<b>💰 برداشت سود</b>",
					joinLine(
						"🪙 %name% (<b>%symbol%</b>) (<b>%price%</b>)",
						"<code>%address%</code>"
					),
					"%wallet%",
					"💸 شما <b>%balance% %symbol%</b> دارید.",
				),
				'price' => 'لطفاً هدف قیمت برای فروش <b>%symbol%</b> در <b>USD</b> و دریافت <b>%type%</b> (مثلاً: <code>%price%</code>) وارد کنید:',
				'amount' => 'لطفاً میزان <b>%symbol%</b> را وارد کنید تا زمانی که به <b>%price%</b> برسد فروش شود:',
				'success' => '✅ برداشت سود شما برای فروش <b>%amount% %symbol%</b> زمانی که <b>%symbol%</b> به <b>%price%</b> برسد با موفقیت قرار داده شد. برای ادامه از /start استفاده کنید.',
				'errors' => [
					'price_invalid'  => 'قیمتی که وارد کرده‌اید یک قیمت عددی معتبر نیست. لطفاً قیمت معتبر وارد کنید. برای لغو می‌توانید از /start استفاده کنید.',
					'price_lower'    => 'قیمتی که وارد کرده‌اید پایین‌تر از <b>%price%</b> فعلی است، می‌توانید برای آن توقف ضرر تنظیم کنید. لطفاً قیمت معتبر وارد کنید. برای لغو می‌توانید از /start استفاده کنید.',
					'amount_invalid' => 'میزانی که وارد کرده‌اید یک مقدار عددی معتبر نیست. لطفاً میزان معتبر وارد کنید. برای لغو می‌توانید از /start استفاده کنید.',
				],
			],
		],
		'trade_sl' => [
			'answer' => '🛑 توقف ضرر 🛑',
			'text'   => joinDoubleLine(
				"🎯 لطفاً دارایی هدفی را که می‌خواهید بفروشید و <b>%type%</b> دریافت کنید انتخاب کنید. اگر دارایی هدف شما در زیر فهرست نشده است، می‌توانید آدرس سفارشی را انتخاب کنید.",
				"%wallet%",
			),
			'condition' => [
				'text' => joinDoubleLine(
					"<b>🛑 توقف ضرر</b>",
					joinLine(
						"🪙 %name% (<b>%symbol%</b>) (<b>%price%</b>)",
						"<code>%address%</code>"
					),
					"%wallet%",
					"💸 شما <b>%balance% %symbol%</b> دارید.",
				),
				'price' => 'لطفاً هدف قیمت برای فروش <b>%symbol%</b> در <b>USD</b> و دریافت <b>%type%</b> (مثلاً: <code>%price%</code>) وارد کنید:',
				'amount' => 'لطفاً میزان <b>%symbol%</b> را وارد کنید تا زمانی که به <b>%price%</b> کاهش یابد فروش شود:',
				'success' => '✅ توقف ضرر شما برای فروش <b>%amount% %symbol%</b> زمانی که <b>%symbol%</b> به <b>%price%</b> کاهش یابد با موفقیت قرار داده شد. برای ادامه از /start استفاده کنید.',
				'errors' => [
					'price_invalid'  => 'قیمتی که وارد کرده‌اید یک قیمت عددی معتبر نیست. لطفاً قیمت معتبر وارد کنید. برای لغو می‌توانید از /start استفاده کنید.',
					'price_higher'   => 'قیمتی که وارد کرده‌اید بالاتر از <b>%price%</b> فعلی است، می‌توانید برداشت سود برای آن تنظیم کنید. لطفاً قیمت معتبر وارد کنید. برای لغو می‌توانید از /start استفاده کنید.',
					'amount_invalid' => 'میزانی که وارد کرده‌اید یک مقدار عددی معتبر نیست. لطفاً میزان معتبر وارد کنید. برای لغو می‌توانید از /start استفاده کنید.',
				],
			],
		],
		'alerts' => [
			'answer' => '🔔 هشدارها 🔔',
			'text'   => joinDoubleLine(
				"💡 شما <b>%count%</b> هشدار فعال دارید (حداکثر: %max%)",
				"%alerts%",
				"⚙️ شما می‌توانید هر هشدار را با کلیک بر روی دکمه‌های زیر مدیریت کنید."
			),
			'buttons' => [
				'new' => 'ایجاد هشدار جدید',
			],
			'create' => [
				'answer' => '🔗 انتخاب بلاکچین 🔗',
				'text' => '🔗 کدام بلاکچین را می‌خواهید پیگیری کنید؟',
			],
			'choose' => [
				'answer' => '🎯 انتخاب هدف 🎯',
				'text'   => "🎯 لطفاً دارایی هدفی را که می‌خواهید پیگیری کنید انتخاب کنید. اگر دارایی هدف شما در زیر فهرست نشده است، می‌توانید آدرس سفارشی را انتخاب کنید.",
			],
			'type' => [
				'answer' => '📊 انتخاب نوع 📊',
				'text' => '📊 در مورد حرکت قیمت <b>%symbol%</b> می‌خواهید از افزایش یا کاهش آن مطلع شوید؟',
				'buttons' => [
					'increase' => '📈 افزایش',
					'decrease' => '📉 کاهش',
				],
			],
			'set' => [
				'answer' => '💲 وارد کردن قیمت 💲',
				'price' => 'لطفاً آستانه قیمت برای <b>%symbol%</b> در <b>USD</b> وارد کنید (مثلاً: <code>%price%</code>):',
				'success_0' => '📉 هشدار شما برای کاهش قیمت <b>%symbol%</b> کمتر از <b>%price%</b> با موفقیت تنظیم شد. برای ادامه از /start استفاده کنید.',
				'success_1' => '📈 هشدار شما برای افزایش قیمت <b>%symbol%</b> بیشتر از <b>%price%</b> با موفقیت تنظیم شد. برای ادامه از /start استفاده کنید.',
				'errors' => [
					'price_invalid'  => 'قیمتی که وارد کرده‌اید یک قیمت عددی معتبر نیست. لطفاً قیمت معتبر وارد کنید. برای لغو می‌توانید از /start استفاده کنید.',
				],
			],
			'delete' => [
				'answer' => '❌ حذف هشدار ❌',
				'text' => joinDoubleLine(
					"<b>آیا از حذف این هشدار مطمئن هستید؟</b>",
					'%alert%',
					"اگر مست نیستید، روی دکمه ⏹️ کلیک کنید تا هشدار حذف شود.",
				),
			],
			'info' => [
				'answer' => '🗒 اطلاعات هشدار 🗒',
				'text' => joinDoubleLine(
					'🗒 اینجا هشدار شما است:',
					'%alert%',
					'⚙️ شما می‌توانید هشدار را با کلیک بر روی دکمه‌های زیر مدیریت کنید.',
				),
				'buttons' => [
					'delete' => '❌ حذف هشدار',
				],
			],
			'errors' => [
				'max' => '🚫 شما به محدودیت <b>%max%</b> تعداد هشدارهای فعال رسیده‌اید، لطفاً قبل از ادامه، برخی از آن‌ها را حذف کنید.',
			],
			'notify' => [
				'0' => '📉 قیمت <b>%symbol%</b> کمتر از <b>%price%</b> کاهش یافت.',
				'1' => '📈 قیمت <b>%symbol%</b> بیشتر از <b>%price%</b> افزایش یافت.',
			],
		],
		'swap' => [
			'answer' => '⚡️ تعویض فوری ⚡️',
			'create' => [
				'answer' => '🔗 انتخاب کیف پول 🔗',
				'text' => joinDoubleLine(
					"<b>⚡️ تعویض فوری ⚡️</b>",
					"%wallets%",
					'💳 لطفاً یک کیف پول برای ادامه انتخاب کنید',
				),
			],
			'choose' => [
				'answer' => '🎯 انتخاب هدف 🎯',
				'text'   => "🎯 لطفاً دارایی هدفی را که می‌خواهید تعویض کنید انتخاب کنید. اگر دارایی هدف شما در زیر فهرست نشده است، می‌توانید آدرس سفارشی را انتخاب کنید.",
			],
			'type' => [
				'answer' => '↔️ انتخاب نوع ↔️',
				'text' => '↔️ چه نوع تعویضی برای <b>%symbol% (%price%)</b> می‌خواهید انجام دهید؟',
				'buttons' => [
					'buy' => '📥 خرید',
					'sell' => '📤 فروش',
				],
			],
			'set' => [
				'answer' => '💲 وارد کردن مقدار 💲',
				'amount_0' => 'لطفاً مقدار <b>%type%</b> برای تعویض با <b>%symbol% (%price%)</b> وارد کنید:',
				'amount_1' => 'لطفاً مقدار <b>%symbol% (%price%)</b> را وارد کنید تا برای فروش ارسال شود:',
				'success_0' => '📥 سفارش خرید شما برای تعویض <b>%amount% %type%</b> به <b>%symbol% (%price%)</b> با موفقیت قرار داده شد. شما از نتیجه تعویض مطلع خواهید شد. برای ادامه از /start استفاده کنید.',
				'success_1' => '📤 سفارش فروش شما برای <b>%amount% %symbol% (%price%)</b> با موفقیت قرار داده شد. شما از نتیجه تعویض مطلع خواهید شد. برای ادامه از /start استفاده کنید.',
				'errors' => [
					'amount_invalid'  => 'مقداری که وارد کرده‌اید یک مقدار عددی معتبر نیست. لطفاً مقدار معتبر وارد کنید. برای لغو می‌توانید از /start استفاده کنید.',
				],
			],
			'transaction' => [
				'success' => '✅ تراکنش تعویض از <b>%from%</b> به <b>%to%</b> با موفقیت انجام شد.',
				'failed' => '❌ تراکنش تعویض از <b>%from%</b> به <b>%to%</b> با شکست مواجه شد.',
			],
		],
		'general' => [
			'buttons' => [
				'price' => 'وارد کردن قیمت',
			],
			'expired' => '⚠️ این پیام منقضی شده است، لطفاً از جدیدترین پیام برای تعاملات استفاده کنید.',
		],
	],
	'general' => [
		'balance' => 'موجودی',
		'address' => 'آدرس',
		'back'    => '🔙 بازگشت',
		'copy'    => 'کپی',
	],
]);
