<?php

defined('i18n_fa') or define('i18n_fa', [
	'private' => [
		'default' => [
			'text' => joinDoubleLine(
				"به <b>%bot_title%</b> خوش آمدید 🙅‍♂️",
				"من بهترین ربات معاملاتی هستم که می‌توانید تنها در ۲-۳ روز و با تقریباً صفر تجربه در بلاکچین داشته باشید.",
				"👛 کیف پول‌های شما:",
				"%wallets%",
				"💡 برای اطلاعات بیشتر در مورد کیف پول خود و دریافت کلید خصوصی، دکمه کیف پول‌ها را بزنید.",
				"🔑 همچنین می‌توانید کیف پول‌های موجود خود را وارد کنید و شرط ببندید که آیا کلاهبرداری خواهید شد یا نه؟ شاید %bot_title%!",
			),
			'buttons' => [
				'wallets'   => '💳 کیف پول‌ها',
				'refresh'   => '🔄 بروزرسانی',
				'alerts'    => '🔔 هشدارها',
				'import'    => '🔑 وارد کردن کیف پول',
				'copy'      => '👁‍🗨 کپی ترید',
				'limit'     => '💢 سفارش محدود',
				'languages' => 'زبان',
			],
		],
	],
	'inline_query' => [
		'notfound' => [
			'title' => 'یافت نشد',
			'message' => "ما هیچ نتیجه‌ای مطابق با جستجوی شما پیدا نکردیم."
		],
	],
	'callback_query' => [
		'fallback' => 'سکوت طلاست',
		'refresh' => '🔄 اطلاعات بروزرسانی شد 🔄',
		'wallets' => [
			'answer' => '💳 لیست کیف پول‌ها 💳',
			'text'   => joinDoubleLine(
				"💡 شما <b>%count%</b> کیف پول فعال دارید (حداکثر: %max%)",
				"%wallets%",
				"⚙️ می‌توانید هر کیف پول را با دکمه‌های زیر مدیریت کنید."
			),
			'buttons' => [
				'new' => 'ایجاد کیف پول جدید',
				'copy' => 'کپی آدرس',
			],
		],
		'create' => [
			'answer' => '🔗 ایجاد کیف پول 🔗',
			'text' => '🔗 چه نوع کیف پولی می‌خواهید ایجاد کنید؟',
		],
		'create_wallet' => [
			'answer' => '⛓️ کیف پول ایجاد شد ⛓️',
			'answer_max' => '🚫 شما در حال حاضر %max%/%max% کیف پول فعال دارید.',
			'text' => joinDoubleLine(
				'⛓️ این کیف پول جدید شماست:',
				'%wallet%',
			),
		],
		'import_wallet' => [
			'answer' => 'به زودی، یا شاید هرگز',
		],
		'wallet_info' => [
			'answer' => '💳 اطلاعات کیف پول 💳',
			'text' => joinDoubleLine(
				'💳 این کیف پول شماست:',
				'%wallet%',
				'⚙️ می‌توانید کیف پول را با دکمه‌های زیر مدیریت کنید.',
			),
			'buttons' => [
				'export' => '📤 خروجی گرفتن از کیف پول',
				'delete' => '❌ حذف کیف پول',
			],
		],
		'wallet_del' => [
			'answer' => '❌ حذف کیف پول ❌',
			'answer_min' => '🚫 شما باید حداقل %min% کیف پول فعال داشته باشید.',
			'text' => joinDoubleLine(
				"<b>آیا واقعاً مطمئن هستید که می‌خواهید این کیف پول را حذف کنید؟</b> در صورتی که آن را خروجی نگرفته و ذخیره نکرده باشید، هیچ راهی برای بازگرداندن آن وجود ندارد.",
				'%wallet%',
				"اگر هوشیار هستید، دکمه ⏹️ را برای حذف کیف پول فشار دهید.",
			),
		],
		'wallet_export' => [
			'answer' => '📤 خروجی گرفتن از کیف پول 📤',
			'text' => joinDoubleLine(
				"🔐 لطفاً اطلاعات زیر را در جای امنی نگه دارید.",
				"%type_emoji% بلاکچین: %type%",
				joinLine("<b>⛓️ آدرس:</b>", "<code>%address%</code>"),
				joinLine("<b>🔓 کلید عمومی:</b>", "<code>%public%</code>"),
				joinLine("<b>🔐 کلید خصوصی:</b>", "<code>%secret%</code>"),
				joinLine("<b>🔏 عبارت بازیابی:</b>", "%mnemonic%"),
				"⚠️ اطلاعات کیف پول خود را با کسی که قول ثروتمند کردن شما را می‌دهد، به اشتراک نگذارید.",
			),
		],
	],
	'general' => [
		'balance' => 'موجودی',
		'address' => 'آدرس',
		'back'    => '🔙 بازگشت',
		'copy'    => 'کپی',
	],
]);
