<?php

defined('i18n_hi') or define('i18n_hi', [
	'private' => [
		'default' => [
			'text' => joinDoubleLine(
				"स्वागत है <b>%bot_title%</b> 🙅‍♂️",
				"मैं निश्चित रूप से सबसे अच्छा बॉट नहीं हूं, जिसे आप ब्लॉकचेन के बारे में लगभग शून्य अनुभव के साथ पा सकते हैं।",
				"%prices%",
				"👛 यह रहे आपके वॉलेट्स:",
				"%wallets%",
				"💡 अपने वॉलेट के बारे में अधिक जानकारी और आपका प्राइवेट की प्राप्त करने के लिए, वॉलेट्स बटन पर टैप करें।",
				"🔑 आप अपने मौजूदा वॉलेट्स भी आयात कर सकते हैं और यह शर्त लगा सकते हैं कि आप धोखा खाएंगे या नहीं, शायद? %bot_title%!",
				"🫰 परीक्षण उद्देश्यों के लिए, आप वॉलेट में शून्य शेष राशि के साथ आदेश बना सकते हैं।",
			),
			'buttons' => [
				'wallets'    => '💳 वॉलेट्स',
				'refresh'    => '🔄 रिफ्रेश',
				'swap'       => '⚡️ इंस्टेंट स्वैप',
				'conditions' => '🗒 शर्तों की सूची',
				'alerts'     => '🔔 अलर्ट्स',
				'import'     => '🔑 वॉलेट आयात करें',
				'copy'       => '👁‍🗨 कॉपी ट्रेडिंग',
				'trade'      => '💸 व्यापार शर्तें',
				'languages'  => 'भाषा',
				'rates'      => '📊 दरों का ट्रैक करें',
			],
		],
		'custom_asset' => [
			'invalid_address' => 'कृपया एक वैध <b>%type%</b> एसेट पता भेजें। आप /start का उपयोग करके इसे रद्द कर सकते हैं।',
			'processing' => '⏳ कृपया प्रतीक्षा करें, हम एसेट को प्रोसेस कर रहे हैं...',
			'invalid_asset' => '❌ दुर्भाग्यवश हम इस एसेट को प्रोसेस नहीं कर पा रहे हैं।',
			'inactive' => '🚫 यह एसेट वर्तमान में DEX में उपलब्ध नहीं है।',
		],
	],
	'inline_query' => [
		'price' => "वर्तमान में <b>%symbol%</b> की कीमत <b>%price%</b> है।",
		'notfound' => [
			'title' => 'नहीं मिला',
			'message' => "हम आपकी खोज से मेल खाने वाला कोई परिणाम नहीं ढूंढ पाए।"
		],
	],
	'callback_query' => [
		'fallback' => 'सिलेंस गोल्ड है',
		'refresh' => '🔄 डेटा अपडेट हो गया 🔄',
		'default' => '✔️',
		'wallets' => [
			'answer' => '💳 वॉलेट सूची 💳',
			'text'   => joinDoubleLine(
				"💡 आपके पास <b>%count%</b> सक्रिय वॉलेट्स हैं (अधिकतम: %max%)",
				"%wallets%",
				"⚙️ आप नीचे दिए गए बटन पर क्लिक करके प्रत्येक वॉलेट का प्रबंधन कर सकते हैं।"
			),
			'buttons' => [
				'new' => 'नया वॉलेट बनाएं',
				'copy' => 'पता कॉपी करें',
			],
		],
		'conditions' => [
			'answer' => '🗒 व्यापार शर्तें 🗒',
			'text'   => joinDoubleLine(
				"💡 आपके पास <b>%count%</b> लंबित व्यापार शर्तें हैं (अधिकतम: %max%)",
				"%conditions%",
				"⚙️ आप नीचे दिए गए बटन पर क्लिक करके प्रत्येक शर्त का प्रबंधन कर सकते हैं।"
			),
			'delete' => [
				'answer' => '❌ शर्त हटाएं ❌',
				'text' => joinDoubleLine(
					"<b>क्या आप सुनिश्चित हैं कि आप इस शर्त को हटाना चाहते हैं?</b>",
					'%condition%',
					"यदि आप नशे में नहीं हैं, तो ⏹️ बटन पर क्लिक करके शर्त को हटाएं।",
				),
			],
			'info' => [
				'answer' => '🗒 शर्त जानकारी 🗒',
				'text' => joinDoubleLine(
					'🗒 यहाँ आपकी शर्त है:',
					'%condition%',
					'⚙️ आप नीचे दिए गए बटन पर क्लिक करके शर्त का प्रबंधन कर सकते हैं।',
				),
				'buttons' => [
					'delete' => '❌ शर्त हटाएं',
				],
			],
			'errors' => [
				'max' => '🚫 आपने पहले ही <b>%max%</b> सक्रिय व्यापार शर्तों की सीमा को पार कर लिया है, कृपया जारी रखने से पहले कुछ हटा दें।',
			],
			'trigger' => "🗒 आपकी <b>%type%</b> <b>%amount% %symbol%</b> के लिए <b>%price%</b> पर ट्रिगर हो गई है और आपको आदेश के परिणाम की सूचना दी जाएगी।",
		],
		'create' => [
			'answer' => '🔗 वॉलेट बनाएं 🔗',
			'text' => '🔗 आप किस प्रकार का वॉलेट बनाना चाहते हैं?',
		],
		'create_wallet' => [
			'answer' => '⛓️ वॉलेट बनाया गया ⛓️',
			'answer_max' => '🚫 आपके पास पहले ही %max%/%max% सक्रिय वॉलेट्स हैं।',
			'text' => joinDoubleLine(
				'⛓️ यहाँ आपका नया वॉलेट है:',
				'%wallet%',
			),
		],
		'import_wallet' => [
			'answer' => 'जल्द ही, या शायद नहीं',
		],
		'wallet_info' => [
			'answer' => '💳 वॉलेट जानकारी 💳',
			'text' => joinDoubleLine(
				'💳 यहाँ आपका वॉलेट है:',
				'%wallet%',
				'⚙️ आप वॉलेट का प्रबंधन करने के लिए नीचे दिए गए बटन पर क्लिक कर सकते हैं।',
			),
			'buttons' => [
				'export' => '📤 वॉलेट निर्यात करें',
				'delete' => '❌ वॉलेट हटाएं',
			],
		],
		'wallet_del' => [
			'answer' => '❌ वॉलेट हटाएं ❌',
			'answer_min' => '🚫 आपके पास कम से कम %min% सक्रिय वॉलेट्स होने चाहिए।',
			'text' => joinDoubleLine(
				"<b>क्या आप वाकई इस वॉलेट को हटाना चाहते हैं?</b> यदि आपने इसे निर्यात और सुरक्षित नहीं किया है, तो इसे पुनर्स्थापित नहीं किया जा सकता।",
				"इसके अलावा ध्यान दें कि वॉलेट हटाने से सभी व्यापार आदेश मिटा दिए जाएंगे।",
				'%wallet%',
				"यदि आप नशे में नहीं हैं, तो ⏹️ बटन पर क्लिक करके वॉलेट को हटाएं।",
			),
		],
		'wallet_export' => [
			'answer' => '📤 वॉलेट निर्यात 📤',
			'text' => joinDoubleLine(
				"🔐 कृपया नीचे दी गई जानकारी को सुरक्षित रखें।",
				"%type_emoji% ब्लॉकचेन: %type%",
				joinLine("<b>⛓️ पता:</b>", "<code>%address%</code>"),
				joinLine("<b>🔓 सार्वजनिक कुंजी:</b>", "<code>%public%</code>"),
				joinLine("<b>🔐 निजी कुंजी:</b>", "<code>%secret%</code>"),
				joinLine("<b>🔏 म्नेमोनिक:</b>", "%mnemonic%"),
				"⚠️ किसी ऐसे व्यक्ति से अपना वॉलेट सीक्रेट साझा न करें, जो आपको अमीर बनाने का वादा करता हो।",
			),
		],
		'languages' => [
			'answer' => 'भाषाएं',
			'text'   => 'कृपया अपनी इच्छित भाषा चुनें:',
		],
		'trade' => [
			'answer' => '💸 व्यापार शर्तें 💸',
			'text'   => joinDoubleLine(
				'💡 आप शर्तों के आधार पर अपने व्यापार को स्वचालित कर सकते हैं।',
				"%wallets%",
				'💳 कृपया व्यापार शर्तें सेट करने के लिए एक वॉलेट चुनें:',
			),
		],
		'custom_asset' => [
			'answer' => 'कृपया %type% ब्लॉकचेन पर एसेट की कॉन्ट्रैक्ट पता भेजें। आप /start का उपयोग करके इसे रद्द कर सकते हैं।',
			'buttons' => [
				'custom' => 'कस्टम पता',
			],
		],
		'trade_info' => [
			'answer' => '💸 व्यापार शर्तें 💸',
			'text'   => joinDoubleLine(
				'💡 आप शर्तों के आधार पर अपने व्यापार को स्वचालित कर सकते हैं।',
				"%wallet%",
			),
			'buttons' => [
				'limit' => '💢 लिमिट ऑर्डर',
				'tp'    => '💰 टेक प्रोफिट',
				'sl'    => '🛑 स्टॉप लॉस',
			],
		],
		'trade_limit' => [
			'answer' => '💢 लिमिट ऑर्डर 💢',
			'text'   => joinDoubleLine(
				"🎯 कृपया वह लक्षित एसेट चुनें जिसे आप अपने <b>%type%</b> के साथ खरीदना चाहते हैं। अगर आपका लक्षित एसेट नीचे सूचीबद्ध नहीं है, तो आप कस्टम पता का चयन कर सकते हैं।",
				"%wallet%",
			),
			'condition' => [
				'text' => joinDoubleLine(
					"<b>💢 लिमिट ऑर्डर</b>",
					joinLine(
						"🪙 %name% (<b>%symbol%</b>) (<b>%price%</b>)",
						"<code>%address%</code>"
					),
					"%wallet%",
					"💸 आपके पास <b>%balance% %symbol%</b> है",
				),
				'price' => 'कृपया <b>%symbol%</b> को <b>%type%</b> में <b>USD</b> में खरीदने के लिए लक्ष्य मूल्य दर्ज करें (जैसे: <code>%price%</code>):',
				'amount' => 'कृपया <b>%type%</b> की मात्रा दर्ज करें जिसे आप <b>%symbol%</b> के लिए स्वैप करना चाहते हैं, जब <b>%symbol%</b> <b>%price%</b> पर पहुंचे:',
				'success' => '✅ आपका लिमिट ऑर्डर <b>%amount% %type%</b> को <b>%symbol%</b> में स्वैप करने के लिए जब यह <b>%price%</b> पर पहुंचे, सफलतापूर्वक सेट किया गया है। आप जारी रखने के लिए /start का उपयोग कर सकते हैं।',
				'errors' => [
					'price_invalid' => 'आपने जो कीमत दर्ज की है, वह एक वैध संख्यात्मक मूल्य नहीं है। कृपया एक वैध मूल्य दर्ज करें। आप /start का उपयोग करके इसे रद्द कर सकते हैं।',
					'price_higher'  => 'आपने जो कीमत दर्ज की है, वह पहले ही वर्तमान <b>%price%</b> से अधिक है, आप तत्काल व्यापार का उपयोग कर सकते हैं। कृपया एक वैध मूल्य दर्ज करें। आप /start का उपयोग करके इसे रद्द कर सकते हैं।',
					'amount_invalid' => 'आपने जो मात्रा दर्ज की है, वह एक वैध संख्यात्मक मात्रा नहीं है। कृपया एक वैध मात्रा दर्ज करें। आप /start का उपयोग करके इसे रद्द कर सकते हैं।',
				],
			],
		],
		'trade_tp' => [
			'answer' => '💰 टेक प्रोफिट 💰',
			'text'   => joinDoubleLine(
				"🎯 कृपया वह लक्षित एसेट चुनें जिसे आप बेचना चाहते हैं और <b>%type%</b> प्राप्त करना चाहते हैं। यदि आपका लक्षित एसेट नीचे सूचीबद्ध नहीं है, तो आप कस्टम पता का चयन कर सकते हैं।",
				"%wallet%",
			),
			'condition' => [
				'text' => joinDoubleLine(
					"<b>💰 टेक प्रोफिट</b>",
					joinLine(
						"🪙 %name% (<b>%symbol%</b>) (<b>%price%</b>)",
						"<code>%address%</code>"
					),
					"%wallet%",
					"💸 आपके पास <b>%balance% %symbol%</b> है",
				),
				'price' => 'कृपया <b>%symbol%</b> को <b>%type%</b> में बेचने और प्राप्त करने के लिए लक्ष्य मूल्य दर्ज करें (जैसे: <code>%price%</code>):',
				'amount' => 'कृपया <b>%symbol%</b> की मात्रा दर्ज करें जिसे आप <b>%price%</b> पर बेचने के लिए चाहते हैं:',
				'success' => '✅ आपका टेक प्रोफिट <b>%amount% %symbol%</b> को <b>%price%</b> पर बेचने के लिए सफलतापूर्वक सेट किया गया है। आप जारी रखने के लिए /start का उपयोग कर सकते हैं।',
				'errors' => [
					'price_invalid'  => 'आपने जो कीमत दर्ज की है, वह एक वैध संख्यात्मक मूल्य नहीं है। कृपया एक वैध मूल्य दर्ज करें। आप /start का उपयोग करके इसे रद्द कर सकते हैं。',
					'price_lower'    => 'आपने जो कीमत दर्ज की है, वह पहले ही वर्तमान <b>%price%</b> से कम है, आप इसके लिए स्टॉप लॉस सेट कर सकते हैं। कृपया एक वैध मूल्य दर्ज करें। आप /start का उपयोग करके इसे रद्द कर सकते हैं।',
					'amount_invalid' => 'आपने जो मात्रा दर्ज की है, वह एक वैध संख्यात्मक मात्रा नहीं है। कृपया एक वैध मात्रा दर्ज करें। आप /start का उपयोग करके इसे रद्द कर सकते हैं।',
				],
			],
		],
		'trade_sl' => [
			'answer' => '🛑 स्टॉप लॉस 🛑',
			'text'   => joinDoubleLine(
				"🎯 कृपया वह लक्षित एसेट चुनें जिसे आप बेचना चाहते हैं और <b>%type%</b> प्राप्त करना चाहते हैं। यदि आपका लक्षित एसेट नीचे सूचीबद्ध नहीं है, तो आप कस्टम पता का चयन कर सकते हैं।",
				"%wallet%",
			),
			'condition' => [
				'text' => joinDoubleLine(
					"<b>🛑 स्टॉप लॉस</b>",
					joinLine(
						"🪙 %name% (<b>%symbol%</b>) (<b>%price%</b>)",
						"<code>%address%</code>"
					),
					"%wallet%",
					"💸 आपके पास <b>%balance% %symbol%</b> है",
				),
				'price' => 'कृपया <b>%symbol%</b> को <b>%type%</b> में बेचने और <b>%price%</b> पर प्राप्त करने के लिए लक्ष्य मूल्य दर्ज करें (जैसे: <code>%price%</code>):',
				'amount' => 'कृपया <b>%symbol%</b> की मात्रा दर्ज करें जिसे आप <b>%price%</b> पर बेचने के लिए चाहते हैं:',
				'success' => '✅ आपका स्टॉप लॉस <b>%amount% %symbol%</b> को <b>%price%</b> पर बेचने के लिए सफलतापूर्वक सेट किया गया है। आप जारी रखने के लिए /start का उपयोग कर सकते हैं।',
				'errors' => [
					'price_invalid'  => 'आपने जो कीमत दर्ज की है, वह एक वैध संख्यात्मक मूल्य नहीं है। कृपया एक वैध मूल्य दर्ज करें। आप /start का उपयोग करके इसे रद्द कर सकते हैं।',
					'price_higher'   => 'आपने जो कीमत दर्ज की है, वह पहले ही वर्तमान <b>%price%</b> से अधिक है, आप टेक प्रोफिट के लिए इसे सेट कर सकते हैं। कृपया एक वैध मूल्य दर्ज करें। आप /start का उपयोग करके इसे रद्द कर सकते हैं।',
					'amount_invalid' => 'आपने जो मात्रा दर्ज की है, वह एक वैध संख्यात्मक मात्रा नहीं है। कृपया एक वैध मात्रा दर्ज करें। आप /start का उपयोग करके इसे रद्द कर सकते हैं।',
				],
			],
		],
		'alerts' => [
			'answer' => '🔔 अलर्ट्स 🔔',
			'text'   => joinDoubleLine(
				"💡 आपके पास <b>%count%</b> सक्रिय अलर्ट्स हैं (अधिकतम: %max%)",
				"%alerts%",
				"⚙️ आप प्रत्येक अलर्ट का प्रबंधन करने के लिए नीचे दिए गए बटन पर क्लिक कर सकते हैं।"
			),
			'buttons' => [
				'new' => 'नया अलर्ट बनाएं',
			],
			'create' => [
				'answer' => '🔗 ब्लॉकचेन चुनें 🔗',
				'text' => '🔗 आप किस ब्लॉकचेन पर ध्यान देना चाहते हैं?',
			],
			'choose' => [
				'answer' => '🎯 लक्ष्य चुनें 🎯',
				'text'   => "🎯 कृपया उस लक्ष्य एसेट को चुनें जिसे आप ट्रैक करना चाहते हैं। यदि आपका लक्ष्य एसेट नीचे सूचीबद्ध नहीं है, तो आप कस्टम पता का चयन कर सकते हैं।",
			],
			'type' => [
				'answer' => '📊 प्रकार चुनें 📊',
				'text' => '📊 आप <b>%symbol%</b> के लिए किस प्रकार की मूल्य गति की सूचना प्राप्त करना चाहते हैं - वृद्धि या कमी?',
				'buttons' => [
					'increase' => '📈 वृद्धि',
					'decrease' => '📉 कमी',
				],
			],
			'set' => [
				'answer' => '💲 मूल्य दर्ज करें 💲',
				'price' => 'कृपया <b>%symbol%</b> के लिए <b>USD</b> में मूल्य सीमा दर्ज करें (जैसे: <code>%price%</code>):',
				'success_0' => '📉 आपका अलर्ट <b>%symbol%</b> के मूल्य गति के लिए <b>%price%</b> से कम हो गया है, सफलतापूर्वक सेट किया गया है। आप जारी रखने के लिए /start का उपयोग कर सकते हैं।',
				'success_1' => '📈 आपका अलर्ट <b>%symbol%</b> के मूल्य गति के लिए <b>%price%</b> से अधिक हो गया है, सफलतापूर्वक सेट किया गया है। आप जारी रखने के लिए /start का उपयोग कर सकते हैं।',
				'errors' => [
					'price_invalid'  => 'आपने जो कीमत दर्ज की है, वह एक वैध संख्यात्मक मूल्य नहीं है। कृपया एक वैध मूल्य दर्ज करें। आप /start का उपयोग करके इसे रद्द कर सकते हैं।',
				],
			],
			'delete' => [
				'answer' => '❌ अलर्ट हटाएं ❌',
				'text' => joinDoubleLine(
					"<b>क्या आप सुनिश्चित हैं कि आप इस अलर्ट को हटाना चाहते हैं?</b>",
					'%alert%',
					"अगर आप नशे में नहीं हैं, तो ⏹️ बटन पर क्लिक करके अलर्ट को हटा सकते हैं।",
				),
			],
			'info' => [
				'answer' => '🗒 अलर्ट जानकारी 🗒',
				'text' => joinDoubleLine(
					'🗒 यहाँ आपका अलर्ट है:',
					'%alert%',
					'⚙️ आप अलर्ट का प्रबंधन करने के लिए नीचे दिए गए बटन पर क्लिक कर सकते हैं।',
				),
				'buttons' => [
					'delete' => '❌ अलर्ट हटाएं',
				],
			],
			'errors' => [
				'max' => '🚫 आपने पहले ही <b>%max%</b> सक्रिय अलर्ट्स की सीमा को पार कर लिया है, कृपया जारी रखने से पहले कुछ हटा दें।',
			],
			'notify' => [
				'0' => '📉 <b>%symbol%</b> की कीमत <b>%price%</b> से कम हो गई है।',
				'1' => '📈 <b>%symbol%</b> की कीमत <b>%price%</b> से अधिक हो गई है।',
			],
		],
		'swap' => [
			'answer' => '⚡️ इंस्टेंट स्वैप ⚡️',
			'create' => [
				'answer' => '🔗 वॉलेट चुनें 🔗',
				'text' => joinDoubleLine(
					"<b>⚡️ इंस्टेंट स्वैप ⚡️</b>",
					"%wallets%",
					'💳 कृपया जारी रखने के लिए वॉलेट चुनें',
				),
			],
			'choose' => [
				'answer' => '🎯 लक्ष्य चुनें 🎯',
				'text'   => "🎯 कृपया वह लक्ष्य एसेट चुनें जिसे आप स्वैप करना चाहते हैं। अगर आपका लक्ष्य एसेट नीचे सूचीबद्ध नहीं है, तो आप कस्टम पता का चयन कर सकते हैं।",
			],
			'type' => [
				'answer' => '↔️ प्रकार चुनें ↔️',
				'text' => '↔️ आप <b>%symbol% (%price%)</b> के लिए किस प्रकार का स्वैप करना चाहते हैं?',
				'buttons' => [
					'buy' => '📥 खरीदें',
					'sell' => '📤 बेचें',
				],
			],
			'set' => [
				'answer' => '💲 राशि दर्ज करें 💲',
				'amount_0' => 'कृपया <b>%type%</b> की राशि दर्ज करें, जिसे आप <b>%symbol% (%price%)</b> के लिए स्वैप करना चाहते हैं:',
				'amount_1' => 'कृपया <b>%symbol% (%price%)</b> की राशि दर्ज करें जिसे आप बेचना चाहते हैं:',
				'success_0' => '📥 आपका खरीद आदेश <b>%amount% %type%</b> को <b>%symbol% (%price%)</b> में स्वैप करने के लिए सफलतापूर्वक रखा गया है। आपको स्वैप के परिणाम की सूचना दी जाएगी। आप जारी रखने के लिए /start का उपयोग कर सकते हैं।',
				'success_1' => '📤 आपका बिक्री आदेश <b>%amount% %symbol% (%price%)</b> सफलतापूर्वक रखा गया है। आपको स्वैप के परिणाम की सूचना दी जाएगी। आप जारी रखने के लिए /start का उपयोग कर सकते हैं।',
				'errors' => [
					'amount_invalid'  => 'आपने जो राशि दर्ज की है, वह एक वैध संख्यात्मक राशि नहीं है। कृपया एक वैध राशि दर्ज करें। आप /start का उपयोग करके इसे रद्द कर सकते हैं।',
				],
			],
			'transaction' => [
				'success' => '✅ स्वैप ट्रांजेक्शन <b>%from%</b> से <b>%to%</b> सफलतापूर्वक हुआ।',
				'failed' => '❌ स्वैप ट्रांजेक्शन <b>%from%</b> से <b>%to%</b> विफल हो गया।',
			],
		],
		'general' => [
			'buttons' => [
				'price' => 'मूल्य दर्ज करें',
			],
			'expired' => '⚠️ यह संदेश समाप्त हो गया है, कृपया बातचीत के लिए नवीनतम संदेश का उपयोग करें।',
		],
	],
	'general' => [
		'balance' => 'बैलेंस',
		'address' => 'पता',
		'back'    => '🔙 वापस',
		'copy'    => 'कॉपी करें',
	],
]);
